import React from 'react';

function Mylife() {
    return (
        <div className='mainbox'>
            <section>
                <h2>Hoi's Life in Coding</h2>
                <div className="about-me">
                    <h3>With Computer</h3>
                    <p class="computer">&nbsp;&nbsp;초등학생 때부터 컴퓨터 방과후에 등록하여 20여개의 자격증을 취득했습니다.
                    중학생 때는 '엔트리'라는 플랫폼에서 프로그램을 제작해 콘테스트에 나가기도 했습니다.
                    &nbsp;&nbsp;고등학생 때에도 동아리를 통해 코딩을 공부했고, 명지대학교 정보통신공학과 진학에 대한 꿈을 꾸게 되었습니다.
                    꿈에 그리던 대학에 합격하고, 명지대학교 정보통신공학과 23학번으로 입학하여 계속해서 컴퓨터와 함께하는 삶을 살아가고 있습니다.
                    </p>
                    <h3>Study Coding</h3>
                    <p class="study-coding">&nbsp;&nbsp;초등학생 때 취득한 CODE 자격증을 준비할 때, 코딩에서 순서를 정리하는 것이 중요하다는 것을 알게 되었습니다.
                    대학생이 되어 배운 문법들을 사용해 주어진 문제를 코드로 제작하는 일을 수행하게 되자, 우선적으로 순서를 정리하는 습관을 들이게 되었습니다.
                    그렇게 정리한 순서를 가지고 차근차근 코드를 작성해 나가니 상대적으로 빠른 시간 내에 과제를 수행해내고, 오류가 발생했을 때 빠르게 원인을 찾을 수 있었습니다.
                    최종적으로 파이썬과 C언어에서 좋은 성적을 얻게 되었습니다.
                    &nbsp;&nbsp;그렇게 코딩에 흥미를 가지고 살아가던 중, 교회에서 개발직을 현업으로 하고 있다는 분을 알게 되었습니다.
                    그 분께서 Java Script를 이용해 마일리지 적립 시스템을 개발한 것을 보았고, 저도 그것을 만들어보고 싶다는 생각을 하게 되었습니다.
                    Java Script를 배우기 전, 웹페이지를 만드는 데에 사용되는 기본적인 언어인 HTML과 그것을 다채롭게 만들어주는 CSS를 먼저 공부하기로 마음먹게 되었습니다.
                    아직은 부족하지만 더 배워서 세상에 도움이 되는 일을 해내려고 합니다.
                    </p>
                </div>    
            </section>
        </div>
        
    );
}

export default Mylife;